app/Http/Controllers/Api/TaskController.php

            }


            $order = [
                'order_number' => $request->order_number ?? null,
                'customer_id' => $cus_id,
                'scheduled_date_time' => ($request->task_type == "schedule") ? $notification_time : null,
                'recipient_phone' => $request->recipient_phone,
                'Recipient_email' => $request->recipient_email,
                'task_description' => $request->task_description,
                'driver_id' => $agent_id,
                'auto_alloction' => $request->allocation_type,
                'images_array' => $last,
                'order_type' => $request->task_type,
                'order_time' => $notification_time,
                'status' => $agent_id != null ? 'assigned' : 'unassigned',
                'cash_to_be_collected' => $request->cash_to_be_collected,
                'unique_id' => $unique_order_id,
                'call_back_url' => $request->call_back_url ?? null,
                'type' => $request->type ?? 0,
                'friend_name' => $request->friend_name,
                'friend_phone_number' => $request->friend_phone_number,
                'request_type' => $request->request_type ?? 'P',
                'is_restricted' => $request->is_restricted ?? 0,
---
select * from `tasks` where `tasks`.`order_id` = 93 and `tasks`.`order_id` is not null and `task_type_id` = 1 limit 1