app/Http/Controllers/Api/TaskController.php

select * from `orders` where `orders`.`id` = 93 limit 1
select * from `customers` where `id` = 18 limit 1
select * from `locations` where `id` = 224 limit 1
select * from `allocation_rules` where `id` = 1 limit 1
---
    public function addRosterNotification($order_id,$header)
    {
        try{
            $orders = Order::findOrFail($order_id);
            $taskcount = $orders->task->count();
            $send_loc_id = $orders->pickup_task_first->location_id;
            $geo = null;
            $agent_id = null;
            $customer = Customer::where('id', $orders->customer_id)->first();

            $finalLocation = Location::where('id', $send_loc_id)->first();
            $pickup_location = $finalLocation;
            $agent_tags = $orders->agent_tags??'';
            $is_order_updated = 0;
            if ($orders->allocation_type === 'a') {
                $geo = $this->createRoster($send_loc_id);
            }
            $notification_time = $orders->order_time;
            $allocation = AllocationRule::where('id', 1)->first();

select * from `clients` limit 1
---
    public function CreateTask(CreateTaskRequest $request)
    {
        try {
            $auth = $client = Client::with([
                'getAllocation',
                'getPreference'
            ])->first();

select * from `client_preferences` where `id` = 1 limit 1
select `timezone` from `clients` where `id` = 1 limit 1
---
                }
            }

            $client = ClientPreference::where('id', 1)->first();
            $clientTimeZoneId = Client::where('id', 1)->value('timezone');

select * from `customers` where `email` = 'newclient@gmail.com' or (CONCAT(dial_code, '', phone_number) = '919150054840' or `phone_number` = '+919150054840') limit 1
---
            if (isset($request->customer_email) || isset($request->customer_phone_number)) {
                $dialCode = $request->customer_dial_code ?? null;
                $customerNo = $dialCode . $request->customer_phone_number;
                $customer = Customer::where('email', $request->customer_email)->orWhere(function ($q) use ($customerNo) {
                    $q->whereRaw("CONCAT(dial_code, '', phone_number) = '" . $customerNo . "'")
                        ->orWhere('phone_number', '+' . $customerNo);
                })
                    ->first();

update `customers` set `phone_number` = '9150054840', `dial_code` = '91', `sync_customer_id` = '2', `user_icon` = 'https://images.royoorders.com/insecure/fill/512/512/sm/0/plain/https://s3.us-west-2.amazonaws.com/royoorders2.0-assets/profile/2b77ae67093a00ef.jpg@webp', `customers`.`updated_at` = '2023-07-27 09:12:49' where `id` = 18
---
                            'user_icon' => !empty($request->user_icon['proxy_url']) ? $request->user_icon['proxy_url'] . '512/512' . $request->user_icon['image_path'] : ''
                        ];

                        Customer::where('id', $cus_id)->update($customer_phone_number);

select * from `orders` where `call_back_url` = 'https://192.168.97.160:9000/dispatch-pickup-delivery/14536064c23511da5d1' limit 1
---
            }

            $is_order_updated = 0;
            $orderexist = Order::where('call_back_url', '=', $request->call_back_url)->first();

insert into `orders` (`order_number`, `customer_id`, `scheduled_date_time`, `recipient_phone`, `Recipient_email`, `task_description`, `driver_id`, `auto_alloction`, `images_array`, `order_type`, `order_time`, `status`, `cash_to_be_collected`, `unique_id`, `call_back_url`, `type`, `friend_name`, `friend_phone_number`, `request_type`, `is_restricted`, `vendor_id`, `order_vendor_id`, `dbname`, `sync_order_id`, `available_seats`, `no_seats_for_pooling`, `is_cab_pooling`, `rejectable_order`, `refer_driver_id`, `is_one_push_booking`, `order_pre_time`, `updated_at`, `created_at`) values ('90073244', 18, '', '9150054840', 'newclient@gmail.com', '', '', 'a', '', 'now', '2023-07-27 09:12:49', 'unassigned', '0', 'K2vrKp', 'https://192.168.97.160:9000/dispatch-pickup-delivery/14536064c23511da5d1', '0', '', '', 'P', 0, '60', '1481', 'salesdemo', '1453', '0', '0', '0', 0, '', 0, 0, '2023-07-27 09:12:49', '2023-07-27 09:12:49')
---
                $orders = Order::find($orderexist->id);
                $is_order_updated = 1;
            } else {
                $orders = Order::create($order);

insert into `locations` (`latitude`, `longitude`, `address`, `customer_id`, `short_name`, `post_code`, `flat_no`, `email`, `phone_number`, `updated_at`, `created_at`) values ('30.718779300000', '76.818034700000', 'Bapu Dham Colony, Sector 26 East, Chandigarh, 160101, India', 18, '', '', '', '', '', '2023-07-27 09:12:49', '2023-07-27 09:12:49')
select * from `locations` where `id` = 224 limit 1
---
                        'phone_number' => $value['phone_number'] ?? null
                    ];

                    $Loction = Location::updateOrCreate($loc, $loc_update);
                    $loc_id = $Loction->id;
                }

                $finalLocation = Location::where('id', $loc_id)->first();

insert into `tasks` (`order_id`, `task_type_id`, `location_id`, `appointment_duration`, `dependent_task_id`, `task_status`, `allocation_type`, `assigned_time`, `barcode`, `vendor_id`, `warehouse_id`, `updated_at`, `created_at`) values (93, '1', 224, '', '', 0, 'a', '', '', '', '', '2023-07-27 09:12:49', '2023-07-27 09:12:49')
---
                    'warehouse_id' => isset($vendor_id) ? $vendor_id->id : null
                ];

                $task = Task::create($data);

update `orders` set `base_price` = '12.00', `base_duration` = '2', `base_distance` = '2.00', `duration_price` = '2.00', `distance_fee` = '2.00', `cancel_fee` = '', `agent_commission_percentage` = 2, `agent_commission_fixed` = 2, `freelancer_commission_percentage` = 2, `freelancer_commission_fixed` = '', `actual_time` = 6, `actual_distance` = 1.01, `order_cost` = 20, `toll_fee` = 0, `driver_cost` = 0, `agent_tags` = '', `orders`.`updated_at` = '2023-07-27 09:12:50' where `id` = 93
---
                ];
            }

            Order::where('id', $orders->id)->update($updateorder);

select * from `tags_for_teams` where (`name` = '245bae_60') limit 1
delete from `task_team_tags` where `task_id` = 92 and `tag_id` in (40)
insert into `task_team_tags` (`tag_id`, `task_id`) values (46, 93)
---
                $value = $request->order_team_tag;
                $tag_id = [];
                if (!empty($value)) {
                    $check = TagsForTeam::firstOrCreate([
                        'name' => $value
                    ]);
                    array_push($tag_id, $check->id);
                }
                $orders->teamtags()->sync($tag_id);

select * from `allocation_rules` where `id` = 1 limit 1
---
            }
            // task schdule code is hare

            $allocation = AllocationRule::where('id', 1)->first();

select * from `locations` where `id` = 224 limit 1
---
    public function createRoster($send_loc_id)
    {
        $getletlong = Location::where('id', $send_loc_id)->first();

select * from `geos`
---
    public function findLocalityByLatLng($lat, $lng)
    {
        // get the locality_id by the coordinate //
        $latitude_y = $lat;
        $longitude_x = $lng;
        $localities = Geo::all();

select * from `clients` where `database_name` = 'sales' limit 1
---
    public function SendToAll($geo, $notification_time, $agent_id, $orders_id, $customer, $finalLocation, $taskcount, $header, $allocation, $is_cab_pooling, $agent_tag = '', $is_order_updated, $is_one_push_booking = 0,$particular_driver_id = 0)
    {
        $allcation_type    = 'AR';
        $date              = \Carbon\Carbon::today();
        $auth              = Client::where('database_name', $header['client'][0])->with(['getAllocation', 'getPreference'])->first();

select * from `client_preferences` where `id` = 1 limit 1
---
    public function GoogleDistanceMatrix($latitude, $longitude)
    {
        $send = [];
        $client = ClientPreference::where('id', 1)->first();

select * from `clients` limit 1
select * from `timezones` where `timezones`.`id` in (251)
---
    public function getDeliveryFee(GetDeliveryFee $request)
    {
        $latitude = [];
        $longitude = [];
        $pricingRule = '';
        $lat = $long = '';

        $auth = Client::with([
            'getAllocation',
            'getPreference',
            'getTimezone'
        ])->first();

select * from `client_preferences` limit 1
select * from `currencies` where `currencies`.`id` in (63)
---
            $total_maximum = 0;
        }

        $client = ClientPreference::take(1)->with('currency')->first();