app/Model/Timezone.php

select `timezone` from `timezones` where `id` = '251' or `timezone` = '251' limit 1
---
    public function timezone_name($timezone_id){
        $timezonedetail = Timezone::where('id',$timezone_id)->orWhere('timezone',$timezone_id)->first('timezone');