app/Listeners/SendPushNotification.php

select `rosters`.*, `roster_details`.`customer_name`, `roster_details`.`customer_phone_number`, `roster_details`.`short_name`, `roster_details`.`address`, `roster_details`.`lat`, `roster_details`.`long`, `roster_details`.`task_count` from `rosters` left join `roster_details` on `rosters`.`detail_id` = `roster_details`.`unique_id` where (`notification_time` <= '2023-07-27 09:12:50') and `status` = 0
delete from `rosters` where `id` in (260, 261)
---
    public function getData()
    {
       Log::info('getData');

        $schemaName       = 'royodelivery_db';
        $date             =  Carbon::now()->toDateTimeString();
        $get              =  DB::connection($schemaName)->table('rosters')->where('notification_time', '<=', $date)->where('status',0)->leftJoin('roster_details', 'rosters.detail_id', '=', 'roster_details.unique_id')->select('rosters.*', 'roster_details.customer_name', 'roster_details.customer_phone_number',
        'roster_details.short_name','roster_details.address','roster_details.lat','roster_details.long','roster_details.task_count')->get();
        $newget           = $get->pluck('id');

     ///   Log::info($newget);
        DB::connection($schemaName)->table('rosters')->where('status',10)->delete();

select * from `clients` where `code` = '745e3f' limit 1
select * from `client_preferences` where `client_id` = '745e3f' limit 1
---
    public function sendnotification($recipients)
    {
        try {

        Log::info('sendnotificationlistener');

        $array = json_decode(json_encode($recipients), true);


        foreach($array as $item){

            if(isset($item['device_token']) && !empty($item['device_token'])){

                $item['title']     = 'Pickup Request';
                $item['body']      = 'Check All Details For This Request In App';
                $new = [];
                array_push($new,$item['device_token']);

                $clientRecord = Client::where('code', $item['client_code'])->first();
                $this->seperate_connection('db_'.$clientRecord->database_name);
                $client_preferences = DB::connection('db_'.$clientRecord->database_name)->table('client_preferences')->where('client_id', $item['client_code'])->first();