app/Listeners/SendPushNotification.php

    public function extraTime($schemaName)
    {
        //sleep(30); ->addSeconds(45)
        $date =  Carbon::now()->toDateTimeString();
        $check = DB::connection($schemaName)->table('rosters')
                        ->where(function ($query) use ( $date) {
                            $query->where('notification_time', '<=', $date)
                                ->orWhere('notification_befor_time', '<=', $date);
                        })
                    ->get();
---
select * from `rosters` where (`notification_time` <= '2023-07-27 09:12:56' or `notification_befor_time` <= '2023-07-27 09:12:56')