app/helpers.php

select * from `client_preferences` limit 1
---
function getClientPreferenceDetail()
{
    $client_preference_detail = ClientPreference::first();

select `id`, `code` from `countries` where `id` = 3 limit 1
---
function getCountryCode($dial_code=''){
    if($dial_code==''):
        $clientData = ClientData::select('country_id')->where('id', Auth::user()->country_id)->first();
        $getAdminCurrentCountry = Countries::where('id', '=', Auth::user()->country_id)->select('id', 'code')->first();

select * from `client_preferences` limit 1
---
function getAgentNomenclature()
{
    $reference = ClientPreference::first();