app/Traits/GlobalFunction.php

select * from `agents` where `id` in (7, 3, 7, 13, 20, 23) and `agents`.`deleted_at` is null order by `id` desc
---

            if($order)
            {
                $geoagents_ids = $geoagents_ids->whereHas('agent', function($q) use ($order){
                    $q->where('id', '!=', $order->driver_id);
                });