app/Traits/GlobalFunction.php

    public function getGeoBasedAgentsData($geo, $is_cab_pooling, $agent_tag = '', $date, $cash_at_hand,$order_id='')
    {
        try {
            $preference = ClientPreference::select('manage_fleet', 'is_cab_pooling_toggle', 'is_threshold','is_go_to_home','go_to_home_radians')->first();
            $geoagents_ids =  DriverGeo::where('geo_id', $geo);
            if($preference->is_cab_pooling_toggle == 1 && $is_cab_pooling == 1){
                $geoagents_ids = $geoagents_ids->whereHas('agent', function($q) use ($geo, $is_cab_pooling){
                    $q->where('is_pooling_available', $is_cab_pooling);
                });
            }

            if($agent_tag !='')
            {
                $geoagents_ids = $geoagents_ids->whereHas('agent.tags', function($q) use ($agent_tag){
                    $q->where('name', '=', $agent_tag);
                });
            }

            $order = Order::find($order_id);

            if($order)
            {
                $geoagents_ids = $geoagents_ids->whereHas('agent', function($q) use ($order){
                    $q->where('id', '!=', $order->driver_id);
                });
            }

            $geoagents_ids =  $geoagents_ids->pluck('driver_id');
---
select `manage_fleet`, `is_cab_pooling_toggle`, `is_threshold`, `is_go_to_home`, `go_to_home_radians` from `client_preferences` limit 1
select * from `orders` where `orders`.`id` = 93 limit 1
select `driver_id` from `driver_geos` where `geo_id` is null and exists (select * from `agents` where `driver_geos`.`driver_id` = `agents`.`id` and `id` is not null and `agents`.`deleted_at` is null)