app/Http/Controllers/DashBoardController.php

    public function index(Request $request)
    {
        $auth = Client::where('code', Auth::user()->code)->with(['getAllocation', 'getPreference'])->first();

        //setting timezone from id
        $tz = new Timezone();
        $auth->timezone = $tz->timezone_name(Auth::user()->timezone);
        $date = date('Y-m-d', time());
        $client = ClientPreference::where('id', 1)->first();
---
select * from `client_preferences` where `client_preferences`.`client_id` in ('745e3f')