app/Http/Controllers/DashBoardController.php

select * from `clients` where `code` = '745e3f' limit 1
select `id`, `map_key_1`, `dashboard_mode` from `client_preferences` limit 1
select * from `countries` where `id` = 3 limit 1
---
    public function index(Request $request)
    {
        $auth = Client::where('code', Auth::user()->code)->with(['getAllocation', 'getPreference'])->first();

        //setting timezone from id
        $tz = new Timezone();
        $auth->timezone = $tz->timezone_name(Auth::user()->timezone);
        $date = date('Y-m-d', time());

        $client = ClientPreference::select('id','map_key_1','dashboard_mode')->first();

        $googleapikey = $client->map_key_1??'';
        $dashboardMode = isset($client->dashboard_mode) ? json_decode($client->dashboard_mode) :'';
        $show_dashboard_by_agent_wise = 0;
        if(!empty($dashboardMode->show_dashboard_by_agent_wise) && $dashboardMode->show_dashboard_by_agent_wise == 1){
            $show_dashboard_by_agent_wise = 1;
        }
        $getAdminCurrentCountry = Countries::where('id', '=', Auth::user()->country_id)->first();

select * from `clients` where `code` = '745e3f' limit 1
---
    public function dashboardTeamData(Request $request)
    {
        $userstatus = isset($request->userstatus)?$request->userstatus:2;
        $is_load_html = isset($request->is_load_html)?$request->is_load_html:1;
        $auth = Client::where('code', Auth::user()->code)->with(['getAllocation', 'getPreference'])->first();

select * from `agents` where `team_id` is null and `agents`.`deleted_at` is null
---
        }

        //left side bar list for display unassigned team
        $unassigned = Agent::where('team_id', null)->with(['order' => function ($o) use ($startdate, $enddate) {
            $o->where('order_time', '>=', $startdate)->where('order_time', '<=', $enddate)->with('customer')->with('task.location');
        }])->get();

select * from `orders` where `order_time` >= '2023-07-26 18:30:00' and `order_time` <= '2023-07-27 18:29:59' and `status` != 'completed'
---
        }

        //create array for map marker
        $allTasks = Order::where('order_time', '>=', $startdate)->where('order_time', '<=', $enddate)->where('status','!=','completed')->with(['customer', 'task.location', 'agent.team'])->get();

select `theme`, `date_format`, `time_format` from `client_preferences` where `id` = 1 limit 1
---
        endif;
        $agents = $agents->get()->toArray();
        // \Log::info($agents);
        $preference  = ClientPreference::where('id', 1)->first(['theme','date_format','time_format']);

select * from `orders` where `order_time` >= '2023-07-26 18:30:00' and `order_time` <= '2023-07-27 18:29:59' and `status` = 'unassigned'
---
        //unassigned_orders
        $unassigned_orders = array();
        $un_total_distance = '';
        $un_order  = Order::where('order_time', '>=', $startdate)->where('order_time', '<=', $enddate)->where('status', 'unassigned')->with(['customer', 'task.location'])->get();

select * from `client_preferences` where `id` = 1 limit 1
select * from `countries` where `id` = 3
---
            }
        }

        $client = ClientPreference::where('id', 1)->first();

        $googleapikey = $client->map_key_1??'';

        $getAdminCurrentCountry = Countries::where('id', '=', Auth::user()->country_id)->get()->first();