app/Jobs/RosterCreate.php

insert into `rosters` (`client_code`, `created_at`, `detail_id`, `device_token`, `device_type`, `driver_id`, `notification_time`, `order_id`, `type`, `updated_at`) values ('745e3f', '2023-07-27 09:12:50', 50505734, 'f3H_hIrjSkiu8Lj9gSztwe:APA91bGbqNvUCAFax_H7LHKNKQNuXRHtEFjj-Sx-Pd79lkLgr72Bzfl5DyE3d2VbHq90b7N8VoF6QjCEVcgzpoOzdesMnSyceNppObajXnzE9k38giwo9KjEVo_ZQ3J8DX5VNNGjO-ct', 'android', 3, '2023-07-27 09:12:49', 93, 'AR', '2023-07-27 09:12:50'), ('745e3f', '2023-07-27 09:12:50', 50505734, 'f3H_hIrjSkiu8Lj9gSztwe:APA91bGbqNvUCAFax_H7LHKNKQNuXRHtEFjj-Sx-Pd79lkLgr72Bzfl5DyE3d2VbHq90b7N8VoF6QjCEVcgzpoOzdesMnSyceNppObajXnzE9k38giwo9KjEVo_ZQ3J8DX5VNNGjO-ct', 'android', 3, '2023-07-27 09:13:59', 93, 'AR', '2023-07-27 09:12:50')
insert into `roster_details` (`customer_name`, `customer_phone_number`, `short_name`, `address`, `lat`, `long`, `task_count`, `unique_id`, `created_at`, `updated_at`) values ('Xavier Ross', '9150054840', '', 'Bapu Dham Colony, Sector 26 East, Chandigarh, 160101, India', '30.71877930', '76.81803470', 2, 50505734, '2023-07-27 09:12:50', '2023-07-27 09:12:50')
insert into `rosters` (`type`, `status`, `updated_at`, `created_at`) values ('extra', 10, '2023-07-27 09:12:50', '2023-07-27 09:12:50')
---
    public function handle()
    {*/
        try {
            $schemaName = 'royodelivery_db';
            $default = [
                'driver' => env('DB_CONNECTION', 'mysql'),
                'host' => env('DB_HOST'),
                'port' => env('DB_PORT'),
                'database' => $schemaName,
                'username' => env('DB_USERNAME'),
                'password' => env('DB_PASSWORD'),
                'charset' => 'utf8mb4',
                'collation' => 'utf8mb4_unicode_ci',
                'prefix' => '',
                'prefix_indexes' => true,
                'strict' => false,
                'engine' => null
            ];


            Config::set("database.connections.$schemaName", $default);

            config(["database.connections.mysql.database" => $schemaName]);

            DB::connection($schemaName)->table('rosters')->insert($this->data);

         //   \Log::info('check roster entry');
            // Log::info(DB::connection($schemaName)->table('rosters')->get());

            DB::connection($schemaName)->table('roster_details')->insert($this->extraData);

            DB::disconnect($schemaName);

            Roster::create([
                'type'  => 'extra',
                'status'=> 10
            ]);